import { ServiceListProps } from "@/type/type 2";

const TermsAndConditions = () => {
  const serviceList: ServiceListProps[] = [
    {
      title: "ข้อตกลงสมัครลงทะเบียนเป็นสมาชิก",
      descriptions: (
        <ul className="text-sm text-muted-foreground">
          <li>
            ผู้สมัครสมาชิกจะต้องมีอายุไม่ต่ำกว่า 18 ปีบริบูรณ์ขึ้นไป
            (ซึ่งต่อไปนี้จะเรียกว่า สมาชิก หรือ ผู้ใช้บริการ)
          </li>
          <li>
            ผู้สมัครสมาชิกจะต้องเป็นผู้ที่มีความคิดและความรับผิดชอบที่ดีต่อสังคมอินเทอร์เน็ต
            ผู้สมัครจะไม่สร้างความเสียหาย เดือดร้อนหรือรำคาญแก่ผู้อื่น เช่น
            การส่งอีเมลโฆษณาเว็บไซต์ของตนไปยังผู้ที่ไม่ได้บอกรับอีเมล หรือ
            ทำการโฆษณาเว็บไซต์ของตนด้วยรูปแบบที่สร้างความเสียหายเดือดร้อนหรือสร้างความรำคาญให้แก่ผู้อื่น
          </li>
          <li>
            สมาชิกจะต้องให้ข้อมูลของสมาชิกที่ถูกต้อง
            และจะพยายามในการแก้ไขข้อมูลของสมาชิกให้เป็นข้อมูลที่เป็นปัจจุบัน
            รวมทั้งมีอีเมลสำหรับการรับข้อมูลข่าวสารต่างๆ ที่เกี่ยวข้องกับบริการ
            ซึ่งจะแก้ไขให้เป็นปัจจุบันอยู่เสมอ
            และหากทางสมาชิกพบว่ามีข้อมูลไม่ถูกต้อง
            สมาชิกมีหน้าที่ต้องแจ้งให้บริษัททราบและทำการแก้ไขทันที
          </li>
        </ul>
      ),
    },
    {
      title: "ความเกี่ยวข้องของสมาชิกกับซาเวียโก",
      descriptions: (
        <ul className="text-sm text-muted-foreground">
          <li>
            สมาชิกรับทราบและยินยอมปฏิบัติตามนโยบาย และ ข้อตกลงในการให้บริการของ
            www.zaviago.com ซึ่งบริหารงานโดย บริษัท ซาเวียโก จำกัด (
            ซึ่งต่อไปนี้จะเรียกว่า บริษัทฯ ) ตั้งอยู่ที่ เลขที่ 999/99 ถนนพระราม
            9 แขวงสวนหลวง เขตสวนหลวง กรุงเทพมหานคร 10250 โทร. 085-823-9549 (
            เฉพาะเวลาทำการ จันทร์ - ศุกร์, 9:30-18:30 )
          </li>
          <li>
            สิ่งที่สมาชิกใช้ ไม่ว่าจะเป็น ผลิตภัณฑ์ ซอฟต์แวร์ บริการ
            หรือเว็บไซต์ ของผู้ให้บริการ ซึ่งต่อไปจะเรียกว่า "บริการ"
          </li>
          <li>
            สมาชิกซึ่งเป็นผู้ใช้บริการไม่ว่าจะส่วนใดส่วนหนึ่งหรือทั้งหมดของผู้ให้บริการ
            ซึ่งต่อไปจะเรียกว่า "ผู้ใช้บริการ" โดยจะแยกได้ดังนี้
            <ul className="mt-0">
              <li>
                เจ้าของสินค้าหรือผู้ที่นำสินค้ามาจัดจำหน่ายบนเว็บไซต์ผ่านบริการของผู้ให้บริการ
                ซึ่งต่อไปจะเรียกว่า "ผู้ขาย"
              </li>
              <li>
                ผู้สั่งซื้อสินค้า และ/หรือ ใช้บริการเว็บไซต์ของผู้ขาย
                ซึ่งต่อไปจะเรียกว่า "ผู้ซื้อ"
              </li>
            </ul>
          </li>
          <li>
            การติดต่อระหว่างบริษัทฯ กับสมาชิก
            จะใช้การติดต่อสื่อสารทางอีเมลและการแจ้งข้อมูลผ่านพื้นที่ข่าวสารในระบบการจัดการเว็บไซต์เป็นหลัก
            โดยสมาชิกท่านใดมีปัญหาการใช้บริการ หรือ
            ต้องการสอบถามเกี่ยวกับบริการสามารถส่งอีเมลมาได้ที่{" "}
            <a href="mailto:marketing@zaviago.com">marketing@zaviago.com</a>{" "}
            กรณีท่าน สมาชิกมีความประสงค์จะติชม
            หรือร้องเรียนปัญหาเกี่ยวกับการบริการ หรือเรื่องอื่นใด
            สามารถส่งอีเมลมาได้ที่{" "}
            <a href="mailto:marketing@zaviago.com">marketing@zaviago.com</a>
          </li>
          <li>
            บริษัทฯ อาจมีการเปลี่ยนแปลงกฎ ระเบียบ และ
            เงื่อนไขการให้บริการเพื่อความเหมาะสมอยู่เสมอโดยบริษัทฯ
            จะแจ้งให้สมาชิกทราบผ่านทางเว็บไซต์{" "}
            <a href="https://zaviago.com">www.zaviago.com</a>{" "}
            หรือผ่านทางหน้าระบบการจัดการเว็บไซต์ โดยบริษัทฯ
            ขอสงวนสิทธิ์ในการเปลี่ยนแปลงโดยไม่ต้องแจ้งให้ทราบล่วงหน้าและไม่รับผิดชอบความเสียหายที่เกิดแก่สมาชิกหรือบุคคลที่สามอันเนื่องมาจากการเปลี่ยนแปลงนี้
          </li>
          <li>
            บริษัทฯ
            ขอสงวนสิทธิ์ในการเพิกถอนสมาชิกภาพของสมาชิกที่ไม่ปฏิบัติตามกฎระเบียบหรือนโยบายของบริษัทฯ
          </li>
        </ul>
      ),
    },
    {
      title: "ข้อตกลงและเงื่อนไขการใช้บริการ",
      descriptions: (
        <ul className="text-sm text-muted-foreground">
          <li>
            การใช้บริการจะต้องอยู่ภายใต้ข้อตกลงการใช้งาน
            รวมถึงวิธีการและเงื่อนไขต่างๆที่บริษัทได้กำหนดไว้
            และจะสามารถใช้บริการได้ก็ต่อเมื่อได้ลงทะเบียนเป็นสมาชิกผู้ใช้บริการ
            (ต่อไปนี้เรียกว่า "สมาชิก")
            อย่างไรก็ตามอาจมีบางกรณีที่บริษัทไม่ยอมรับการการลงทะเบียนเป็นสมาชิก
          </li>
          <li>
            บริการเว็บไซต์สำเร็จรูปเป็นบริการที่บริษัทฯ ได้ทำการออกแบบ
            พัฒนาเทมเพลต (Template)
            และโปรแกรมให้สมาชิกใช้งานร่วมกันสมาชิกสามารถใส่ข้อมูล, รูปภาพ
            และเนื้อหาผ่านระบบการสร้างและบริหารเว็บไซต์ของ zaviago.com
          </li>
          <li>
            บริษัทฯ ขอสงวนลิขสิทธิ์ในเทมเพลต (Template)
            โปรแกรมและระบบการสร้างและบริหารเว็บไซต์ ห้ามมิให้ผู้ใดคัดลอก
            ทำซ้ำหรือ นำไปใช้ที่อื่นโดยไม่ได้รับอนุญาตอย่างเป็นลายลักษณ์อักษร
          </li>
          <li>
            บริการเว็บไซต์สำเร็จรูปนี้ ไม่มีนโยบายให้สมาชิกอัปโหลดไฟล์, โปรแกรม,
            รวมถึงไฟล์ html ที่สร้างจากโปรแกรมอื่นๆ เข้าสู่เว็บไซต์
            การส่งข้อมูลขึ้นแสดงในเว็บสำเร็จรูปของท่านจะต้องใช้เพียงอินเทอร์เน็ตบราวเซอร์ส่งรูปและข้อความเข้าสู่ระบบตามตำแหน่งที่ต้องการตามวิธีการใช้งานของระบบเท่านั้น
          </li>
          <li>
            บริษัทฯ
            ไม่มีนโยบายที่จะจัดทำโปรแกรมให้เป็นการเฉพาะแก่สมาชิกท่านใดท่านหนึ่ง
            ซึ่งปกติการจัดทำโปรแกรมเป็นการเฉพาะนี้จะมีค่าใช้จ่ายสูงมากโดยเรียกว่าการจ้างจัดทำเว็บไซต์แบบ
            Tailor Made (Customize) แต่บริษัทฯ
            จะพัฒนาระบบการจัดทำเว็บไซต์ให้มีความหลากหลายและยืดหยุ่นในการใช้งานเพื่อประโยชน์ต่อสมาชิกส่วนรวมเป็นหลัก
            อย่างไรก็ตาม บริษัทฯ
            ยินดีรับฟังความคิดเห็นและคำแนะนำของสมาชิกทุกท่าน
            และขอสงวนสิทธิ์ที่จะเลือกคำแนะนำมาปรับปรุงบริการต่อไป
          </li>
          <li>
            ในบางกรณี หากบริษัทฯ
            จัดทำโปรแกรมให้เป็นการเฉพาะแก่สมาชิกท่านใดท่านหนึ่ง บริษัทฯ
            จะพัฒนาอยู่ในระบบมาตรฐานของ zaviago.com
            โดยอาจจะมีหรือไม่มีค่าใช้จ่าย
            ขึ้นอยู่กับการตกลงกันของสมาชิกและบริษัทฯ หลังจากนั้น บริษัทฯ
            ขอสงวนสิทธิ์ในการนำโปรแกรมนั้น ให้บริการกับสมาชิกท่านอื่นๆ ด้วย
            และถือเป็นทรัพย์สินของบริษัทฯ หากสมาชิกไม่ใช้บริการของ zaviago.com
            แล้ว
            สมาชิกจะไม่สามารถนำโปรแกรมนั้นไปใช้ได้เนื่องจากถูกจัดทำในระบบของ
            zaviago.com
          </li>
          <li>
            สมาชิกได้ศึกษาและเข้าใจในคุณลักษณะของสินค้าและบริการต่างๆ ที่บริษัทฯ
            มีให้แล้ว ดังที่แสดงในหน้าเว็บไซต์ zaviago.com
            และสมาชิกตัดสินใจซื้อสินค้าและบริการด้วยคุณลักษณะที่มีอยู่นี้
            และยอมรับการเปลี่ยนแปลงที่จะมีในอนาคต
          </li>
          <li>
            สมาชิกได้ตกลงยอมรับเงื่อนไขการใช้บริการในเเต่ละแพ็คเกจที่ได้เลือกซื้อบริการ
            ซึ่งมีรายละเอียดในเเต่ละแพ็คเกจอย่างชัดเจน
            โดยเงื่อนไขในแต่ละแพ็คเกจได้ระบุขอบเขตการใช้บริการ
            โดยที่สมาชิกได้ตกลงยอมรับก่อนทำการซื้อบริการเป็นที่เรียบร้อยแล้ว
          </li>
          <li>
            สมาชิกยอมรับการเปลี่ยนแปลงไปของฟีเจอร์ (Feature) ต่างๆ
            ในลักษณะของการพัฒนาและปรับปรุงเวอร์ชันใหม่
            ทั้งในเรื่องการเพิ่มลดฟีเจอร์, การปรับปรุงพัฒนาวิธีการใช้งาน, User
            Interface, การเพิ่มความปลอดภัยของระบบ ฯลฯ
            ทั้งในส่วนของเว็บไซต์และการปรับปรุงเปลี่ยนแปลงการบริการด้านอื่นๆ
          </li>
          <li>
            สมาชิกตกลงชำระค่าบริการจดโดเมนเนมและค่าใช้งานระบบเว็บสำเร็จรูปเป็นรายเดือนและชำระค่าต่ออายุในเดือนต่อๆ
            ไปเพื่อใช้งานบริการของบริษัทฯ
            หากสมาชิกไม่ชำระเงินค่าบริการระบบตามแพ็คเกจที่ได้เลือกซื้อไว้
            บริษัทขอยุติการให้บริการในฟีเจอร์ที่ระบุในแพ็คเกจดังกล่าว
            แต่อย่างไรก็ตามสถานภาพของสมาชิกยังคงดำเนินต่อไปและสมาชิกจะสามารถใช้งานบริการได้อีกครั้งหลังจากชำระเงินค่าบริการให้กับบริษัทฯ
            ตามแพ็คเกจที่ได้เลือกใช้บริการ
          </li>
          <li>
            บริษัทฯ มีบริการออกแบบเว็บไซต์
            ซึ่งเป็นการออกแบบเฉพาะสำหรับเว็บไซต์ของสมาชิกแต่ละท่านภายใต้โปรแกรมเว็บสำเร็จรูปของ
            zaviago.com แต่บริษัทฯ สามารถให้บริการกับสมาชิกท่านอื่นๆ
            ที่ทำธุรกิจเดียวกันหรือใกล้เคียงกันได้โดยการออกแบบให้มีความแตกต่างกัน
          </li>
          <li>
            ระยะเวลาที่บริษัทฯ
            จะใช้ในการบริการออกแบบเว็บไซต์ในสัญญาบริการเริ่มนับตั้งแต่วันที่บริษัทฯ
            ได้รับการชำระค่าบริการและได้รับข้อมูลจากสมาชิกครบถ้วนเพียงพอในการออกแบบเว็บไซต์
            โดยทางบริษัทจะใช้ Email
            ในการเก็บประวัติการสนทนาเพื่อใช้ในการเป็นหลักฐานอ้างอิงการตกลงระหว่างสมาชิกกับบริษัท
          </li>
          <li>
            บริษัทขอสงวนสิทธิ์ไม่ให้บริการเว็บไซต์ดังต่อไปนี้
            ที่ใช้ในจุดประสงค์อื่นๆ ที่ไม่ใช่เพื่อการซื้อ-ขายสินค้า หรือ
            ไม่ใช่เพื่อประชาสัมพันธ์บริษัท เช่น
            <ul className="mt-0">
              <li>เว็บไซต์รับประกาศสินค้า</li>
              <li>เว็บไซต์รวมลิงก์หนัง, โหลดบิท</li>
              <li>เว็บไซต์สื่อกลางระหว่างเว็บไซต์</li>
              <li>เว็บไซต์ ลามก-อนาจาร</li>
              <li>เว็บไซต์ขายสินค้าแบบ Affiliate เป็นต้น</li>
            </ul>
          </li>
          <li>
            ข้อตกลงในการจำหน่ายสินค้า
            โดยผู้ให้บริการขอสงวนสิทธิ์ไม่ให้บริการเว็บไซต์ร้านค้าที่จำหน่ายหรือประชาสัมพันธ์สินค้าดังต่อไปนี้
            <ul className="mt-0">
              <li>สินค้าผิดกฎหมายหรือขัดต่อศีลธรรมอันดีของไทย</li>
              <li>
                สินค้าแบบ Affiliate จากเว็บไซต์ออนไลน์อื่นๆ เช่น Amazon.com
                เป็นต้น
              </li>
              <li>
                สินค้าที่เกี่ยวข้องกับการพนันทุกประเภท เช่น การเล่นคาสิโนออนไลน์
                สถานที่ที่รับพนันขันต่อ บิงโก
              </li>
              <li>
                สินค้าที่เกี่ยวข้องกับ Download MP3 , Software , VDO & Voice
                Clips , Music Online ที่ผิดกฎหมายทุกประเภท
              </li>
              <li>
                สินค้าลอกเลียนแบบ ไม่ได้รับอนุญาต ละเมิดเครื่องหมายการค้า
                สิทธิบัตร ลิขสิทธิ์ หรือ
                ทรัพย์สินทางปัญญาของผู้อื่นหรือคณะบุคคลอื่นในทุกประเทศทั่วโลก
              </li>
              <li>
                ฝิ่น ยาสูบ ยาเสพติดทุกชนิด หรือบุหรี่ เหล้า เบียร์ที่ผิดกฎหมาย
              </li>
              <li>
                สัตว์ที่ใกล้สูญพันธุ์หรือสัตว์ที่ได้รับความคุ้มครองตามกฎหมาย
                รวมทั้งผลิตภัณฑ์ที่ผลิตจากสัตว์เหล่านี้
              </li>
              <li>
                ผลิตภัณฑ์ที่ใช้ถอดรหัสเคเบิลและสัญญาณดาวเทียมเพื่อใช้บริการเคเบิลฟรี
              </li>
              <li>
                เครื่องสำอาง ยา หรืออาหารเสริม ที่ไม่ได้รับอนุญาตจาก อย.
                ในประเทศไทยเป็นต้น
              </li>
              <li>
                ยา สมุนไพร และอุปกรณ์ส่วนตัวที่เกี่ยวกับการใช้ยาที่ผิดกฎหมาย
              </li>
              <li>
                จำหน่ายหรือส่งเสริมการรักษาหรือการเยียวยาที่ไม่สามารถตรวจพิสูจน์ได้
                หรือรายการอื่นๆ
                ที่ทำตลาดว่าเป็นสิ่งที่ใช้เพื่อฟื้นฟูสุขภาพได้อย่างรวดเร็ว
              </li>
              <li>
                อุปกรณ์พลุไฟ วัสดุและสสารที่มีพิษ ระเบิดได้ ติดไฟ
                และมีกัมมันตรังสี
                ซึ่งรวมไปถึงข้อมูลเกี่ยวกับวิธีสร้างอุปกรณ์ระเบิด
              </li>
              <li>อาวุธหรืออุปกรณ์อันตรายที่ผิดกฎหมาย</li>
              <li>สินค้าที่มีการโฆษณาเกินจริง</li>
              <li>
                บารากู่ บารากู่ไฟฟ้าหรือบุหรี่ไฟฟ้า หรือตัวยาบารากู่
                น้ํายาสําหรับเติมบารากู่ไฟฟ้าหรือบุหรี่ไฟฟ้า
              </li>
            </ul>
          </li>
        </ul>
      ),
    },
    {
      title: "ผลิตภัณฑ์และบริการ",
      descriptions: (
        <ul className="text-sm text-muted-foreground">
          <li>
            เงื่อนไขการให้บริการ เว็บไซต์สำเร็จรูป และ อีเมล
            <ul className="mt-0">
              <li>
                บริษัทขอสงวนสิทธิ์ในการเก็บประวัติการใช้งานเฉพาะส่วนของการรับส่งเป็นระยะเวลา
                90 วัน ซึ่งเป็นไปตาม พ.ร.บ. 2550
                ว่าด้วยการกระทำผิดเกี่ยวกับคอมพิวเตอร์ พ.ศ. 2550
                โดยกำหนดให้ผู้ให้บริการต้องเก็บข้อมูลจราจรทางคอมพิวเตอร์ไว้ไม่น้อยกว่า
                90 วัน นับตั้งแต่วันที่ข้อมูลนั้นเข้าสู่ระบบคอมพิวเตอร์
                ผู้ให้บริการจะต้องเก็บรักษาข้อมูลเท่าที่จำเป็นเพื่อสามารถระบุตัวผู้ใช้บริการนับตั้งแต่เริ่มใช้บริการและต้องเก็บรักษาไว้ไม่น้อยกว่า
                90 วันนับตั้งแต่การบริการสิ้นสุดลง
              </li>
              <li>
                บริษัทขอสงวนสิทธิ์ในการกำหนดการส่งอีเมล ไม่เกิน 60
                ฉบับต่อชั่วโมง ต่อบัญชี (Account) เพื่อป้องกันการกระจายของ Spam
                หรือ Virus จากโปรแกรม หรือ คอมพิวเตอร์ของสมาชิก
                (เฉพาะแพ็กเกจที่มีบริการอีเมลร่วมอยู่เท่านั้น)
              </li>
              <li>
                บริษัทขอสงวนสิทธิ์ในการแบน (Ban) IP Address ในกรณีที่ตรวจพบว่า
                IP นั้นมีความเสียงที่จะโจมตีระบบของบริษัทและ/หรือมีการพยายาม Log
                on ระบบผิดพลาดเกิน 10 ครั้ง ในกรณีที่สมาชิกลืม Password
                สามารถเเจ้งบริษัทให้ Reset Password ได้
              </li>
              <li>
                บริษัทขอสงวนสิทธิ์ในการบล็อก (Block) อีเมลในการส่งออก
                หากตรวจพบรูปแบบในการส่งอีเมลเข้าข่ายเป็น Spam
                เพื่อเป็นการไม่รบกวนระบบของท่านอื่น
                (เฉพาะแพ็กเกจที่มีบริการอีเมลร่วมอยู่เท่านั้น)
              </li>
              <li>
                บริษัทขอสงวนสิทธิ์ในกรณีที่บริษัทไปออกงาน หรือ มหกรรม ต่างๆ
                อาจมีโปรโมชันแพ็กเกจราคาค่าบริการเว็บไซต์ซึ่งเป็นค่าบริการสำหรับผู้สมัครใช้บริการเว็บไซต์ใหม่ภายในงานเท่านั้น
              </li>
            </ul>
          </li>
          <li>
            เงื่อนไขการให้บริการของแต่ละแพ็กเกจ
            <ul className="mt-0">
              <li>
                <strong>กรณีแพ็คเกจ “ใช้ฟรี FOREVER”</strong>
                <br />
                หากผู้ใช้บริการไม่ได้ทำการ login เข้าใช้ระบบของผู้ให้บริการภายใน
                15 วันทำการ
                ผู้ให้บริการขอสงวนสิทธิ์ระงับการเข้าใช้งานเว็บไซต์ดังกล่าวโดยมิต้องแจ้งให้ทราบล่วงหน้าและหลังจากได้รับการเเจ้งเตือนผ่าน
                Email เเล้ว ยังไม่มีการ Login อีกภายใน 15
                วันหลังจากนั้นทางผู้ให้บริการขอสงวนสิทธิ์ในการลบบัญชีของสมาชิกโดยไม่ต้องแจ้งให้ทราบล่วงหน้า
                <ul className="mt-0">
                  <li>Domain ที่จะได้รับ yourname.site.zaviago.com</li>
                  <li>พื้นที่เว็บไซต์ 1 GB</li>
                  <li>จำนวนหน้าเว็บเพจ 1 หน้า</li>
                  <li>รองรับ 1 ภาษา</li>
                  <li>รองรับระบบขายของออนไลน์</li>
                  <li>รองรับระบบขนส่ง</li>
                </ul>
              </li>
              <li>
                <strong>กรณีแพ็คเกจ “เปิดเว็บขายของ”</strong>
                <br />
                รายละเอียดแพ็กเกจสามารถเข้าไปดูได้ตามลิงก์{" "}
                <a href="https://zaviago.com/ราคาการใช้ระบบ/">
                  https://zaviago.com/ราคาการใช้ระบบ/
                </a>
              </li>
              <li>
                <strong>กรณีแพ็คเกจ "Sale Page", "Basic" และ "Premium"</strong>
                <br />
                <ul className="mt-0">
                  <li>
                    ผู้ให้บริการขอสงวนสิทธิ์ในการเริ่มออกแบบจนกว่าจะได้รับข้อมูลจากทางผู้ใช้บริการครบถ้วน
                    ไม่ว่าจะเป็น โลโก้, CI, Mood & Tone,Sitemap ของเว็บไซต์,
                    ข้อมูล + ภาพ สินค้า/บริการ, รูปภาพ, วิดีโอ,
                    ตัวอย่างเว็บไซต์ที่ชอบ และ อื่นๆ ที่ต้องจำเป็นต่อการออกแบบ
                  </li>
                  <li>
                    จำนวนหน้าที่ออกแบบเป็นไปตามแพ็กเกจที่ลูกค้าใช้บริการ
                    <a href="https://zaviago.com/บริการเปิดเว็บให้/">
                      https://zaviago.com/บริการเปิดเว็บให้/
                    </a>
                  </li>
                  <li>
                    หากผู้ใช้บริการต้องการดีไซน์มากกว่าจำนวนหน้าในแพ็คเกจที่มีอยู่
                    จะมีค่าใช้จ่ายเพิ่มเติมขึ้นอยู่กับจำนวนหน้าและรูปแบบของดีไซน์
                    ซึ่งผู้ให้บริการจะแจ้งให้ผู้ใช้บริการทราบก่อนการเริ่มต้นการออกแบบ
                  </li>
                  <li>
                    ผู้ใช้บริการสามารถแจ้งแก้ไขแบบเว็บไซต์ได้ไม่เกิน 2
                    ครั้งและแจ้งเป็นลายลักษณ์อักษรทางอีเมลแก่ผู้ให้บริการรับทราบ
                    ทั้งนี้ การแจ้งแก้ไขในแต่ละครั้ง ผู้ใช้บริการ
                    จะเป็นผู้รับผิดชอบในการแจ้งแก้ไขโดยละเอียดให้กับผู้ให้บริการ
                    รวบยอดในแต่ละครั้ง และ หากมีการแก้ไขเกินกว่า 2 ครั้ง
                    ผู้ให้บริการจะเป็นผู้ประเมินค่าใช้จ่ายเพิ่มเติมที่อาจเกิดขึ้นซึ่งอยู่กับการแจ้งแก้ไขออกเป็นกรณี
                    ดังนี้
                  </li>
                  <li>
                    การแก้ไขแบบ Major ที่รวมไปถึง เช่น การปรับโลโก้, CI, Mood &
                    Tone, Sitemap ของเว็บไซต์, การปรับ Layout, ฟอนต์ และ/หรือ
                    การปรับดีไซน์บางจุด
                    ที่ทำให้กระเทือนดีไซน์เดิมที่วางไว้ในหลายจุด
                    (ดีไซน์แก้ไขครั้งที่ 1 และ 2) เป็นต้น อันเป็นเหตุให้
                    ต้องมีการออกแบบกราฟฟิกภาพใหม่ จะมีค่าใช้จ่ายเพิ่มเติม
                  </li>
                  <li>
                    การแก้ไขแบบ Minor ที่รวมไปถึง เช่น
                    การปรับเปลี่ยนเฉพาะจุดในแต่ละหน้า เช่น การเปลี่ยนสี,
                    ขนาดตัวอักษร, เปลี่ยนตำแหน่งการวางภาพ, เปลี่ยนภาพ
                    (ไม่รวมถึงการออกแบบภาพนั้นๆ ใหม่) เป็นต้น จะไม่มีค่าใช้จ่าย
                    <br />* ซึ่งการแก้แบบ Minor จะแก้ได้มากที่สุด 3 จุด ต่อ 1
                    หน้า เท่านั้น หากมีการแจ้งแก้ไขมากกว่าจำนวนดังกล่าว
                    จะมีค่าใช้จ่ายเพิ่มเติมขึ้นอยู่กับจำนวนจุดที่ต้องการแก้ไข
                    ซึ่งผู้ให้บริการจะแจ้งให้ผู้ใช้บริการทราบก่อนเริ่มต้นการแก้ไข
                  </li>
                  <li>
                    รูปภาพ และ ข้อมูลอื่นๆ ที่ผู้ใช้บริการส่งมา
                    ผู้ใช้บริการได้ทำการตรวจสอบเป็นอย่างดีแล้วว่าเป็นข้อมูลลิขสิทธิ์ที่ถูกต้องของผู้ใช้บริการแล้วเท่านั้น
                    หากพบว่ามีการละเมิดลิขสิทธิ์
                    ผู้ให้บริการขอสงวนสิทธิ์ในการรับผิดชอบความเสียหายใดๆ
                    ที่อาจเกิดขึ้นทุกกรณี
                  </li>
                  <li>
                    การออกแบบเว็บไซต์นี้ ไม่รวมค่าเขียนข้อความ (Copywriting),
                    ค่าฟอนต์ลิขสิทธิ์, ค่ารูปภาพ, ค่าถ่ายภาพ,
                    ค่าพิมพ์ชิ้นงานตัวอย่าง, ค่าจ้างพนักงานส่งเอกสาร
                    ถ้ามีและหากจําเป็นต้องใช้หรือมีกรณีอื่นใดที่อาจก่อให้เกิดค่าใช้จ่ายเพิ่มเติมอื่นนอกจากที่ตกลงกัน
                    ทางผู้ให้บริการจะเสนอเรื่องเพื่อให้ผู้ใช้บริการพิจารณาล่วงหน้า
                    เมื่อผู้ใช้บริการตกลงยินยอมในรายการค่าใช้จ่ายที่ที่เพิ่มขึ้น
                    ผู้ใช้บริการตกลงชําระค่า ใช้จ่ายที่เพิ่มขึ้นทั้งหมดภายใน 10
                    วัน นับแต่ได้รับใบเรียกเก็บเงินจากผู้ให้บริการ
                  </li>
                  <li>
                    ผู้ให้บริการจะนำแบบธีมเว็บไซต์ทำออกมาเป็นเว็บไซต์จริงก็ต่อเมื่อได้รับการยืนยันตามแบบจากผู้ใช้บริการทางอีเมล
                  </li>
                  <li>
                    หลังจากผู้ใช้บริการแจ้งยืนยันทำเว็บตามแบบกับผู้ให้บริการ
                    ผู้ใช้บริการจะไม่สามารถแจ้งแก้ไขดีไซน์เว็บไซต์ใดๆ ได้อีก
                    หากต้องการแก้ไขหรือปรับรูปแบบของเว็บไซต์เพิ่มเติมจะมีค่าใช้จ่ายต่างหาก
                    ซึ่งผู้ให้บริการจะแจ้งให้ผู้ใช้บริการทราบล่วงหน้าถึงค่าใช้จ่ายที่จะเกิดขึ้น
                  </li>
                </ul>
              </li>
              <li>
                ในกรณีที่บริษัทไปออกงาน หรือ มหกรรม ต่างๆ
                อาจมีโปรโมชันแพ็คเกจราคาค่าบริการเว็บไซต์ซึ่งเป็นค่าบริการสำหรับผู้สมัครใช้บริการเว็บไซต์ใหม่ภายในงานเท่านั้น
              </li>
            </ul>
          </li>
          <li>
            เงื่อนไขการให้บริการระบบรับชำระสินค้าผ่านบัตรเครดิตและ Mobile
            Banking (เฉพาะแพ็คเกจที่ได้มีการชำระค่าบริการรายปีตั้งเเต่ 5,000
            ขึ้นไปเท่านั้น)
            <ul className="mt-0">
              <li>
                <strong>การขอเปิดใช้บริการนี้ เปิดใช้งานได้ 2 แบบ</strong>
                <br />
                <strong>บุคคลธรรมดา</strong>
                <ul className="mt-0">
                  <li>
                    สำเนาบัตรประจำตัวประชาชนเจ้าของกิจการ <br />
                    หมายเหตุ: สำเนาเอกสารใบเปลี่ยนชื่อ กรณีเคยเปลี่ยนชื่อ
                  </li>
                  <li>
                    สำเนาบัญชีธนาคาร <br />
                    หมายเหตุ: ชื่อเจ้าของบัญชีจะต้องตรงกับชื่อของเจ้าของกิจการ
                  </li>
                  <li>โลโก้ร้านค้า</li>
                </ul>
                <strong>นิติบุคคล</strong>
                <ul className="mt-0">
                  <li>สำเนาบัตรประจำตัวประชาชนกรรมการผู้มีอำนาจลงนาม</li>
                  <li>ภ.พ.20</li>
                  <li>หนังสือรับรองการจัดตั้งบริษัท</li>
                  <li>
                    สำเนาบัญชีธนาคาร <br />
                    หมายเหตุ: ชื่อเจ้าของบัญชีจะต้องตรงกับชื่อของเจ้าของกิจการ
                  </li>
                  <li>โลโก้ร้านค้า/บริษัท</li>
                </ul>
              </li>
              <li>
                ทางบริษัทฯ
                จะเป็นผู้ดำเนินเรื่องในการประสานงานเพื่อให้ลูกค้าสามารถเปิดใช้บริการกับผู้ให้บริการ
                Payment Gateway ตามกำหนดของแพลตฟอร์ม
                โดยระเบียบจะต้องเป็นไปตามเงื่อนไขของผู้ให้บริการ Payment Gateway
                และลูกค้าจะต้องเซ็นตกลงยอมรับเงื่อนไขการเปิดใช้งานระบบ Online
                Payment Gateway
                โดยที่บริษัทจะเป็นผู้อำนวยความสะดวกในการติดตั้งเท่านั้น
              </li>
              <li>
                ทางบริษัทผู้ให้บริการ Payment Gateway
                จะมีการแสดงผลข้อมูลตามรายการสั่งซื้อที่ชำระด้วยช่องทางต่างๆ
                ให้ทางลูกค้าสามารถดูรายละเอียดได้
              </li>
              <li>
                การชำระสินค้าออนไลน์ผ่านบัตรเครดิต จะรองรับบัตรเครดิตและเดบิต
                ที่เป็นของ Visa, MasterCard, JCB หรือ เป็นไปตามที่ผู้ให้บริการ
                Payment Gateway เป็นผู้กำหนด
              </li>
            </ul>
          </li>
        </ul>
      ),
    },
    {
      title: "ผู้ใช้บริการตกลงจะปฏิบัติตามข้อตกลงและเงื่อนไขต่างๆ",
      descriptions: (
        <p className="text-sm text-muted-foreground">
          บทความเนื้อหา รูปภาพ และ/หรือ
          สินค้าในเว็บไซต์ที่ทางสมาชิกได้ลงเอาไว้ในระบบ
          หากเป็นการละเมิดลิขสิทธิ์และมีการเรียกร้องค่าเสียหาย ทางบริษัทฯ
          จะไม่รับผิดชอบความเสียหายใดๆ ทั้งสิ้น ซึ่งถ้าหากทางบริษัทฯ
          ได้รับเเจ้งว่าเนื้อหาหรือสินค้านั้นเป็นการละเมิดลิขสิทธิ์ บริษัทฯ
          จะปิดระบบการใช้งานของสมาชิกชั่วคราวได้โดยมิต้องบอกกล่าวล่วงหน้า
          จนกว่าสมาชิกจะสามารถยืนยันและพิสูจน์ได้ว่ามิได้ละเมิดลิขสิทธิ์เเต่อย่างใด
          และอาจปิดระบบการใช้งานของสมาชิกอย่างถาวรหากความผิดนั้นถูกพิสูจน์ได้ว่าเป็นจริง
        </p>
      ),
    },
    {
      title: "การต่ออายุแพ็คเกจและยกเลิกการเป็นสมาชิก",
      descriptions: (
        <ul className="text-sm text-muted-foreground">
          <li>
            การต่ออายุเว็บไซต์เป็นหน้าที่ของสมาชิก
            โดยสมาชิกจะทราบวันที่หมดอายุของแพ็คเกจเว็บไซต์ได้โดยการเข้าสู่ระบบของซาเวียโกเพื่อตรวจสอบวันหมดอายุของแพ็คเกจ
            และแจ้งความประสงค์ในการต่ออายุเข้ามาที่บริษัทฯ ล่วงหน้าอย่างน้อย 7
            วันก่อนวันหมดอายุ บริษัทฯ
            จะสนับสนุนด้วยการส่งอีเมลและโทรแจ้งเตือนล่วงหน้า แต่อย่างไรก็ตาม
            แม้ว่าสมาชิกจะไม่ได้รับอีเมล หรือไม่ได้รับการโทรแจ้งเตือนก็ตาม
            สมาชิกยังคงต้องรับผิดชอบการต่ออายุแพ็คเกจของตน
          </li>
          <li>
            สมาชิกสามารถยกเลิกบริการได้เสมอ
            โดยส่งอีเมลแจ้งความประสงค์ขอยกเลิกบริการมาได้ที่{" "}
            <a href="mailto:marketing@zaviago.com">marketing@zaviago.com</a>{" "}
            ซึ่งโดเมนเนมนั้นจะยังคงเป็นกรรมสิทธิ์ของสมาชิกท่านนั้น
            และสามารถนำไปใช้งานสำหรับจัดทำเว็บไซต์ของตนเองได้ตามปกติต่อไป
            เว้นเสียแต่ว่าในกรณีที่สมาชิกใช้โดเมนเมน yourname.site.zaviago.com
            โดเมนเนมนี้จะยังคงเป็นกรรมสิทธิ์ของบริษัทฯ และทางบริษัทฯ
            อาจอนุญาตให้สมาชิกท่านอื่นใช้โดเมนเนมของสมาชิกที่ได้ยกเลิกบริการกับบริษัทฯ
            แล้ว
          </li>
          <li>
            หากสมาชิกยกเลิกหรือถูกยกเลิกการเป็นสมาชิกกับทางบริษัทฯ
            สมาชิกจะไม่สามารถเข้าสู่เว็บไซต์และระบบการจัดการเว็บไซต์ได้อีก
            และบริษัทฯ
            จะลบข้อมูลในเว็บไซต์ทั้งหมดตามรอบระยะเวลาการลบข้อมูลของบริษัทฯ
            ดังนั้น สมาชิกจึงต้องเก็บข้อมูลต่างๆ ไว้ในแหล่งเก็บข้อมูลอื่นๆ
            ของสมาชิกเองเพื่อให้สามารถนำข้อมูล รูปภาพและเนื้อหาต่างๆ
            ไปจัดทำเว็บไซต์ได้เองต่อไป
          </li>
          <li>
            ในกรณีที่สมาชิกขอยกเลิกการใช้บริการเอง ทางบริษัทฯ
            ของสงวนสิทธิ์ในการคืนเงินค่าแพ็กเกจทั้งหมด
          </li>
        </ul>
      ),
    },
    {
      title: "ขอบเขตความรับผิดชอบของผู้ให้บริการ",
      descriptions: (
        <ul className="text-sm text-muted-foreground">
          <li>
            บริษัทฯ
            ไม่รับผิดชอบต่อความเสียหายไม่ว่าในลักษณะใดที่เกิดขึ้นจากการใช้บริการ
            ไม่ว่าทางตรงหรือทางอ้อม
          </li>
          <li>
            ข้อมูล ภาพประกอบ และเนื้อหาต่างๆ ที่สมาชิกนำมาลงในเว็บไซต์นั้น
            ถือเป็นความรับผิดชอบของสมาชิก บริษัทฯ
            ไม่รับผิดชอบต่อความเสียหายที่เกิดขึ้นเนื่องจากการใช้งาน,
            การรุกล้ำสิทธิ์ส่วนบุคคล หรือปัญหาต่างๆ
            ที่เกิดขึ้นระหว่างสมาชิกกับผู้อื่น
          </li>
          <li>
            ข้อมูลและเนื้อหาที่สมาชิกนำมาลงในเว็บนั้น
            จะต้องไม่เป็นข้อมูลที่ผิดกฏหมายหรือขัดต่อศีลธรรมของสังคม
            และหากพบว่ามีเกิดขึ้น บริษัทฯ ขอสงวนสิทธิ์ในการลบเนื้อหานั้น ๆ ออกไป
            หรือปิดเว็บไซต์นั้นๆ
            จนกว่าจะได้รับการแก้ไขตามระยะเวลาที่บริษัทฯกำหนด
          </li>
          <li>
            บริษัทฯ มีข้อกำหนดด้านนโยบายความเป็นส่วนตัว (Privacy Policy)
            ซึ่งบริษัทฯจะไม่เปิดเผยข้อมูลลูกค้าให้กับสาธารณะ
            ยกเว้นใช้งานเพื่อประชาสัมพันธ์ หรือเป็นตัวอย่างสินค้าของบริษัทฯ
            เท่านั้น
          </li>
          <li>
            ผู้ให้บริการไม่อาจให้การรับประกันว่า
            บริการจะมีอย่างต่อเนื่องโดยไม่มีการหยุด หรือไม่มีข้อบกพร่องใด ๆ
            และผู้ให้บริการจะไม่รับผิดชอบต่อการกระทำโดยจงใจ
            หรือโดยประมาทเลินเล่อในการทำหน้าที่ของบุคคลที่สาม เช่น
            ปัญหาการเชื่อมต่ออินเตอร์เน็ต การติดขัดในช่องสัญญาณ
            เครือข่ายอินเตอร์เน็ต การสื่อสารผิดพลาด ภัยธรรมชาติ การก่อการร้าย
            อัคคีภัย หรือการหยุดให้บริการชั่วคราว
            และจากปัญหาที่มิได้เป็นปัญหาของผู้ให้บริการเอง
          </li>
          <li>
            ผู้ให้บริการจะไม่รับผิดชอบค่าเสียหายหรือค่าตอบแทนใดๆ ทั้งสิ้น
            หากผู้ใช้บริการถูกหลอกลวงหรือฉ้อโกงทรัพย์สิน จากผู้ใช้บริการอื่น
            แต่ทางผู้ให้บริการยินดีที่จะให้ความช่วยเหลือถึงที่สุดเพื่อให้ได้ทรัพย์สินของผู้ใช้บริการกลับคืนมา
          </li>
          <li>
            หากสมาชิกได้กระทำผิดตามข้อตกลงของสัญญาฉบับนี้
            หรือทุจริตในการซื้อ-ขายสินค้า
            ผู้ใช้บริการจำเป็นต้องชดเชยต่อความเสียหายอันเกิดจากการกระทำดังกล่าวต่อผู้ให้บริการ
            และ/หรือบุคคลอื่นที่ได้รับความเสียหาย
            หรือถูกละเมิดจากกรณีดังกล่าวทั้งหมด
            รวมถึงจะต้องถูกดำเนินคดีตามกฎหมายต่อไป
          </li>
          <li>
            ผู้ให้บริการมีหน้าที่เพียงให้บริการในการอำนวยความสะดวกในการซื้อขายสินค้าระหว่างผู้ซื้อและผู้ขายเท่านั้น
            ผู้ให้บริการไม่มีส่วนเกี่ยวข้องใดๆ กับสินค้าของผู้ขายแต่อย่างใด
          </li>
        </ul>
      ),
    },
    {
      title: "ข้อตกลงในการยกเลิกการใช้บริการ",
      descriptions: (
        <ul className="text-sm text-muted-foreground">
          <li>
            ในกรณีที่ผู้ใช้บริการต้องการยกเลิกการใช้บริการหรือปรับลดบริการลง
            ก่อนครบกำหนดสัญญา
            ผู้ให้บริการขอสงวนสิทธิ์ในการคืนค่าบริการและผู้ใช้บริการไม่มีสิทธิ์เรียกค่าบริการคืน
            ไม่ว่าบางส่วนหรือทั้งหมดได้
            เว้นแต่ทางผู้ให้บริการจะเป็นผู้ยกเลิกบริการเอง
            โดยจะคืนค่าบริการตามสมควรเท่านั้น
            และผู้ใช้บริการจะไม่สามารถเรียกร้องค่าเสียหายอื่น ๆ
            ที่เกิดขึ้นกับการใช้บริการนั้นๆ
            นอกเหนือจากค่าบริการที่ผู้ใช้บริการได้ชำระกับผู้ให้บริการแล้วเท่านั้น
          </li>
          <li>
            กรณีมีการละเมิดข้อตกลงการใช้งานผู้ให้บริการจะแจ้งเตือนและจะหยุดให้บริการหากผู้ใช้บริการไม่ทำการแก้ไขให้ถูกต้อง
            และผู้ใช้บริการจะไม่สามารถเรียกร้องสิทธิ์ในการคืนเงินได้
            และหากเป็นการกระทำที่ส่งผลกระทบต่อระบบและเครือข่าย
            รวมถึงชื่อเสียงของผู้ให้บริการ
            ผู้ใช้บริการจะต้องรับผิดชอบความเสียหายทั้งหมดที่เกิดขึ้น
          </li>
        </ul>
      ),
    },
    {
      title: "การระงับการใช้บริการ",
      descriptions: (
        <div>
          <p className="text-sm text-muted-foreground">
            หากผู้ให้บริการตรวจพบเว็บไซต์ร้านค้าที่กระทำผิดตามข้อตกลงตามที่จะกล่าวดังต่อไปนี้
            จะดำเนินการงดการให้บริการทันที
            โดยผู้ให้บริการจะไม่มีการคืนค่าบริการใดๆ ทั้งสิ้น
            และไม่จำเป็นต้องแจ้งให้ทราบล่วงหน้า
            ทั้งนี้ผู้ให้บริการขอสงวนสิทธิ์ในการพิจารณาตรวจสอบร้านค้าว่าผิดตามข้อตกลงหรือไม่
            หากมีข้อโต้แย้งใดๆ ให้ถือเอาคำตัดสินของผู้ให้บริการเป็นที่สิ้นสุด
          </p>
          <ul className="text-sm text-muted-foreground">
            <li>
              ผิดกฎหมายหรือขัดต่อศีลธรรมอันดีของไทย เช่น
              การละเมิดลิขสิทธิ์ของผู้อื่น การข่มขู่
              เว็บไซต์ที่เกี่ยวกับสื่อลามก หรือ เนื้อหาส่อไปทางลามก
              กิจกรรมทางเพศ ขายบริการทางเพศ
              รวมทั้งเว็บไซต์ที่มีลิงก์ไปยังเว็บไซต์ที่เกี่ยวกับสื่อลามก
            </li>
            <li>
              เกี่ยวข้องกับธุรกิจเครือข่าย
              และผลิตภัณฑ์ที่จำหน่ายโดยมีความสัมพันธ์ตามค่าคอมมิชชั่น
              ซึ่งรวมทั้งหน้ารายการที่ทำขึ้นมาจากโฆษณาเป็นหลัก
            </li>
            <li>
              พบทุจริต ฉ้อโกง ในการซื้อ-ขาย ไม่ว่ากรณีใดๆ ทั้งสิ้น
              (ทั้งในอดีตและปัจจุบัน)
              ทั้งนี้ผู้ให้บริการขอสงวนสิทธิ์ในการตัดสินใจว่าสิ่งใดถือว่าเป็นการทุจริต
            </li>
            <li>
              เกี่ยวกับ Hacker, Warez, Crack, เผยแพร่ไวรัส หนอนอินเตอร์เน็ต
              โทรจัน หรืออื่นๆ ที่เกี่ยวข้องกับซอฟท์แวร์ผิดกฎหมาย
            </li>
            <li>
              หลอกลวงผู้อื่นด้วยการแสดงข้อความอันเป็นเท็จ โฆษณาเกินจริง
              หรือปกปิดข้อความจริงซึ่งควรบอกให้แจ้ง
            </li>
            <li>
              ใช้งานที่ส่งผลกระทบกระเทือนต่อระบบและทรัพยากรของระบบ อาทิเช่น
              การใช้งาน CPU เกินขอบเขต, การใช้งาน Email เกินขอบเขต, การเจาะระบบ
              (Hacking), การใช้งานโปรแกรม IRC Bots หรือการใช้งานโปรแกรมใด ๆ
              ที่ส่งผลกระทบต่อการทำงานของระบบ
              โดยผู้ให้บริการขอสงวนสิทธิ์ในการพิจารณาว่าการใช้งานใดเป็นการใช้งานอย่างเกินขอบเขต
            </li>
            <li>
              มีการนำพื้นที่ อีเมล หรือ ทรัพยากรอื่นๆ ที่ได้รับบริการ
              ไปแจกจ่ายต่อไปยังบุคคลอื่นในลักษณะฟรี หรือที่เรียกกันว่า Free
              email และ Free Hosting
            </li>
            <li>
              มีการทำ Commercial Mass Emailing หรือ "Spamming" ไม่ว่ากรณีใดๆ
              ทั้งสิ้น เช่น การส่งโฆษณาไปยังอีเมลผู้อื่นโดยผู้อื่นไม่ได้ขอ,
              การส่งอีเมลโดยใช้ที่อยู่ส่งกลับที่ไม่มีจริงทางด้านธุรกิจ,
              การส่งข้อความลูกโซ่เพื่อจะทำให้เกิดการตอบกลับจำนวนมาก
              และการส่งข้อความซ้ำๆ เดิมๆ ไปยังผู้อื่น เป็นต้น
            </li>
            <li>
              นำเข้าข้อมูลและไฟล์ต่างๆ ที่มีไวรัสหรือมัลแวร์
              ลงบนเครื่องเซิฟเวอร์ของผู้ให้บริการ
            </li>
            <li>
              มีการ เพิ่ม เปลี่ยนแปลง หรือลบ การทำงานหรือการแสดงผลส่วนต่างๆ
              ของระบบร้านค้า เช่น การนำตะกร้าสินค้า,
              การสร้างสัญลักษณ์หรือภาพของตนเองเจตนาหลอกลวงว่าเป็นของระบบ
            </li>
            <li>
              สมาชิกค้างชำระค่าบริการต่างๆ กับบริษัทฯ
              เกินระยะเวลาที่ทางบริษัทเเจ้งเอาไว้ (ค่าบริการเว็บไซต์)
            </li>
            <li>
              ผู้ให้บริการขอสงวนสิทธิ์ในการระงับการให้บริการชั่วคราว
              ในกรณีที่ท่านใช้พื้นที่เกินที่ได้กำหนดไว้ หรือ
              สิ้นสุดสัญญาการใช้บริการ
              โดยไม่จำเป็นต้องแจ้งให้ทราบล่วงหน้าแต่อย่างใด
            </li>
          </ul>
        </div>
      ),
    },
    {
      title: "เกี่ยวกับระบบ",
      descriptions: (
        <ul className="text-sm text-muted-foreground">
          <li>
            บริษัทฯ พยายามอย่างเต็มที่ในการจัดการระบบให้มีเสถียรภาพ
            แต่หากมีปัญหาสุดวิสัยที่ทำให้เว็บไซต์ไม่สามารถออนไลน์ได้ชั่วขณะ
            หรือมีปัญหาอื่นใดระหว่างสมาชิกกับลูกค้าของเว็บไซต์ บริษัทฯ
            ไม่รับผิดชอบในความเสียหายที่อาจจะมีขึ้นนั้น
          </li>
          <li>
            สมาชิกจะต้องเก็บข้อมูล รูปภาพ และเนื้อหาต่างๆ
            ที่นำมาแสดงในหน้าเว็บไซต์ไว้ในแหล่งเก็บข้อมูลอื่นๆ ของสมาชิกเอง
            ดังนั้นหากมีปัญหาสุดวิสัยที่ข้อมูล รูปภาพและเนื้อหาต่างๆ
            ที่แสดงไว้สูญหายไป
            สมาชิกสามารถนำต้นฉบับของตนเองมาใส่ในระบบการจัดการเว็บไซต์ใหม่ได้
            อย่างไรก็ตาม บริษัทฯ พยายามอย่างเต็มที่ที่จะรักษาข้อมูลต่างๆ
            ของสมาชิกไม่ให้สูญหาย
          </li>
          <li>
            บริษัทฯ ได้จัดเตรียมระบบการ Backup
            ข้อมูลของสมาชิกตามมาตรฐานของบริษัทฯ
            ในกรณีที่เกิดความเสียหายกรณีร้ายแรง บริษัทฯ ยังสามารถนำข้อมูลที่
            Backup เก็บไว้มาใช้งาน ณ ครั้งล่าสุดที่มีการ Backup สมบูรณ์ บริษัทฯ
            ได้พัฒนาปรับปรุงระบบการ Backup
            อย่างต่อเนื่องเพื่อให้สามารถจัดเก็บข้อมูลและนำกลับมาใช้ได้อย่างมีประสิทธิภาพ
            อย่างไรก็ตาม ทางบริษัทฯ
            ไม่ได้รับประกันความเสียหายที่เกิดขึ้นในกรณีที่ข้อมูลที่จัดเก็บมีความสูญหาย
          </li>
          <li>
            ส่วนของบริการอีเมลแบบ Pop
            เนื่องจากระบบอีเมลปัจจุบันเป็นระบบที่มีข้อมูลจำนวนมากและมีการเปลี่ยนแปลงตลอดเวลา
            สมาชิกสามารถใช้โปรแกรมอีเมลเช่น Outlook
            เพื่อดึงข้อมูลมาเก็บไว้ที่เครื่องคอมพิวเตอร์ส่วนบุคคล บริษัทฯ
            แนะนำให้สมาชิกใช้โปรแกรมอีเมลดังกล่าวดึงข้อมูลจาก Mail Server
            มาไว้ที่เครื่องคอมพิวเตอร์ส่วนบุคคลเป็นประจำสม่ำเสมอ อย่างไรก็ตาม
            บริษัทฯ ไม่ได้มีระบบการ Backup ข้อมูลอีเมลของสมาชิก
            รวมทั้งไม่ได้รับประกันความเสียหายที่เกิดขึ้นในกรณีที่ข้อมูลอีเมลที่จัดเก็บที่
            Mail Server สูญหาย
          </li>
        </ul>
      ),
    },
    {
      title: "ข้อตกลงในการเปลี่ยนแปลงข้อตกลงและเงื่อนไขต่างๆ",
      descriptions: (
        <ul className="text-sm text-muted-foreground">
          <li>
            บริษัทสามารถเปลี่ยนแปลงนโยบายข้อตกลงและเงื่อนไขต่างๆ
            ในการให้บริการได้โดยไม่จำเป็นต้องแจ้งให้ทราบล่วงหน้า
          </li>
          <li>
            ผู้ใช้บริการต้องเข้าใจและยอมรับข้อตกลงและเงื่อนไขต่างๆ
            ของบริษัทที่ได้มีการเปลี่ยนแปลงแล้ว
            หากผู้ใช้บริการเข้าใช้บริการหลังมีการเปลี่ยนแปลงข้อตกลงและเงื่อนไขต่างๆ
            ผู้ใช้ต้องตกลงและยอมรับเงื่อนไขใหม่ที่ทางบริษัทได้ประกาศไว้ทุกกรณี
          </li>
        </ul>
      ),
    },
  ];

  return (
    <div className="space-y-4">
      <p className="text-sm text-muted-foreground">
        สมาชิกรับทราบและยินยอมปฏิบัติตามนโยบาย และ ข้อตกลงในการใช้บริการของ{" "}
        <a href="https://zaviago.com">www.zaviago.com</a> ซึ่งบริหารงานโดย
        บริษัท ซาเวียโก จำกัด ( ซึ่งต่อไปนี้จะเรียกว่า บริษัทฯ ) ตั้งอยู่ที่
        เลขที่ 999/99 ถนนพระราม 9 แขวงสวนหลวง เขตสวนหลวง กรุงเทพมหานคร 10250
        โทร. 085-823-9549 ( เฉพาะเวลาทำการ จันทร์ - ศุกร์ 9:30-18:00 )
        มีนโยบายและข้อตกลงในการใช้บริการดังต่อไปนี้
        <br />
        <br />
        หมายเหตุ: หากท่านมีข้อสงสัยใดๆ สามารถส่งอีเมลมาได้ที่
        marketing@zaviago.com
      </p>

      <h2 className="text-foreground text-lg">
        เงื่อนไขการใช้บริการแพลตฟอร์มซาเวียโก
      </h2>

      {serviceList.map((list) => (
        <div className="space-y-2">
          <h2 className="text-base">{list.title}</h2>
          {list.descriptions}
        </div>
      ))}
    </div>
  );
};

export default TermsAndConditions;
